﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <NCT6683DHwmSetup.uni>
//
// Description: SIO Form String Definitions
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_NCT6683D_HMM_CONFIGURATION                   #language eng "Hardware Monitor"
#string STR_NCT6683D_HMM_CONFIGURATION_HELP              #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                    #language eng "Pc Health Status"
//G160-004(11)  #string STR_NCT6683D_HMM_VIN0                            #language eng "VIN0"
//G160-004(11) - start
#string STR_NCT6683D_HMM_VIN0                            #language eng "CPU VCORE"
//G160-004(11) - end
#string STR_NCT6683D_HMM_VIN0_VALUE                      #language eng "N/A"

#string STR_NCT6683D_PECI_TEMP1                          #language eng "PECI Agent1 Temp"
#string STR_NCT6683D_PECI_TEMP1_VALUE                    #language eng "N/A"
#string STR_NCT6683D_PCH_TEMP1                           #language eng "PCH Temperature"
#string STR_NCT6683D_PCH_TEMP1_VALUE                     #language eng "N/A"

#string STR_NCT6683D_HMM_VIN11                           #language eng "VIN11"
#string STR_NCT6683D_HMM_VIN11_VALUE                     #language eng "N/A"
#string STR_NCT6683D_HMM_VIN12                           #language eng "VIN12"
#string STR_NCT6683D_HMM_VIN12_VALUE                     #language eng "N/A"
#string STR_NCT6683D_HMM_VIN13                           #language eng "VIN13"
#string STR_NCT6683D_HMM_VIN13_VALUE                     #language eng "N/A"

//G160-004(11) - start
#string STR_NCT6683D_SMARTFAN_MODE                       #language eng "Smart Fan"
#string STR_NCT6683D_SMARTFAN_MODE_HELP                  #language eng "Enable or disable Smart fan function."

#string STR_NCT6683D_THERMAL_OFF                         #language eng "Fan Off Temperature"
#string STR_NCT6683D_THERMAL_OFF_HELP                    #language eng "Select smart fan off temperature(0~127)."

#string STR_NCT6683D_THERMAL_START                       #language eng "Fan Start Temperature"
#string STR_NCT6683D_THERMAL_START_HELP                  #language eng "Select smart fan start temperature(0~127)."

#string STR_NCT6683D_THERMAL_TARGET                      #language eng "Fan Full Speed Temperature"
#string STR_NCT6683D_THERMAL_TARGET_HELP                 #language eng "Select smart fan full speed temperature(0~127)."

#string STR_NCT6683D_FAN_START_DUTY                      #language eng "Fan Start Duty"
#string STR_NCT6683D_FAN_START_DUTY_HELP                 #language eng "Select smart fan start duty(0~255)."

#string STR_NCT6683D_FAN_MANUAL_DUTY                     #language eng "Fan Duty"
#string STR_NCT6683D_FAN_MANUAL_DUTY_HELP                #language eng "Select smart fan duty(0~255)."
//G160-004(11) - end
    
//#string <string name>                   #language eng ""
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
